Performance Testing/Outputs (10 seconds)/output_30users.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: k6-script.js

    duration: 10s, iterations: -
         vus: 30,  max: 30

    init [----------------------------------------------------------] starting
    ✓ Content-Type is present
    ✓ Your test name
    ✗ Successful POST request
     ↳  89% — ✓ 107 / ✗ 13
    ✗ Status code is 200
     ↳  99% — ✓ 2287 / ✗ 13
    ✗ Response time is less than 200ms
     ↳  35% — ✓ 180 / ✗ 325

    checks.....................: 90.42% ✓ 3315 ✗ 351 
    data_received..............: 8.9 MB 892 kB/s
    data_sent..................: 306 kB 31 kB/s
    http_req_blocked...........: avg=643.04µs min=0s     med=996.2µs max=29.91ms  p(90)=998.2µs  p(95)=998.8µs 
    http_req_connecting........: avg=584.07µs min=0s     med=0s      max=28.92ms  p(90)=998.2µs  p(95)=998.8µs 
    http_req_duration..........: avg=119.02ms min=2.99ms med=41.88ms max=778.91ms p(90)=370.01ms p(95)=500.73ms
    http_req_receiving.........: avg=1.32ms   min=0s     med=970.7µs max=64.82ms  p(90)=1.99ms   p(95)=5.02ms  
    http_req_sending...........: avg=52.56µs  min=0s     med=0s      max=4.98ms   p(90)=0s       p(95)=0s      
    http_req_tls_handshaking...: avg=0s       min=0s     med=0s      max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=117.65ms min=1.99ms med=40.89ms max=778.91ms p(90)=368.52ms p(95)=500.66ms
    http_reqs..................: 2441   244.056634/s
    iteration_duration.........: avg=2.25s    min=2.15s  med=2.24s   max=2.38s    p(90)=2.35s    p(95)=2.36s   
    iterations.................: 120    11.997868/s
    vus........................: 30     min=30 max=30
    vus_max....................: 30     min=30 max=30