Performance Testing/Outputs (10 seconds)/output_5users.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: k6-script.js

    duration: 10s, iterations: -
         vus: 5,   max: 5

    init [----------------------------------------------------------] starting
    ✗ Status code is 200
     ↳  99% — ✓ 2349 / ✗ 7
    ✓ Response time is less than 200ms
    ✓ Content-Type is present
    ✓ Your test name
    ✗ Successful POST request
     ↳  96% — ✓ 132 / ✗ 5

    checks.....................: 99.68% ✓ 3853 ✗ 12 
    data_received..............: 9.9 MB 992 kB/s
    data_sent..................: 347 kB 35 kB/s
    http_req_blocked...........: avg=630.68µs min=0s       med=996.3µs  max=11.97ms  p(90)=998.5µs  p(95)=999.1µs 
    http_req_connecting........: avg=567µs    min=0s       med=995.3µs  max=11.97ms  p(90)=998.4µs  p(95)=999µs   
    http_req_duration..........: avg=18.18ms  min=985.6µs  med=6.98ms   max=172.05ms p(90)=48.86ms  p(95)=66.83ms 
    http_req_receiving.........: avg=1.28ms   min=0s       med=0s       max=42.92ms  p(90)=1.99ms   p(95)=5.98ms  
    http_req_sending...........: avg=49.24µs  min=0s       med=0s       max=1.99ms   p(90)=0s       p(95)=0s      
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=16.85ms  min=985.6µs  med=5.98ms   max=170.05ms p(90)=46.87ms  p(95)=64.88ms 
    http_reqs..................: 2491   249.077847/s
    iteration_duration.........: avg=362.84ms min=283.91ms med=350.64ms max=561.35ms p(90)=424.86ms p(95)=458.91ms
    iterations.................: 136    13.598791/s
    vus........................: 5      min=5  max=5
    vus_max....................: 5      min=5  max=5